EA/src/InformationRegisters/ПолученныеСообщенияОбменовДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПолученныеСообщенияОбменовДанными</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбновитьНомерВУзлеПослеЗагрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоследнегоСообщенияПринятогоУзлом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Загружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидТранспортаОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаСообщенийОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыВыполненияОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщенияРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнеОчередиСообщений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/InformationRegisters/СформированныеСообщенияОбменовДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СформированныеСообщенияОбменовДанными</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбновитьНомерВУзлеПослеЗагрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоследнегоСообщенияПринятогоУзлом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выгружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидТранспортаОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаСообщенийОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыВыполненияОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщенияРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнеОчередиСообщений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/WebServices/ExchangeFromUniversalXML/Module.bsl
Функция PutMessage(NamePlane, CodeHub, StructMessage)
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить( "БылиОшибки", Ложь );
	СтруктураРезультата.Вставить( "ТекстОписанияОшибки", "" );
	
	УзелИнформационнойБазы = ОбменДаннымиСервер.ПолучитьСсылкуУзлаПоИмениПланаОбменаИКоду( NamePlane, CodeHub );
	
	Если УзелИнформационнойБазы = Неопределено Тогда
		
		СтруктураРезультата.БылиОшибки = Истина;
		СтруктураРезультата.ТекстОписанияОшибки = "Не найден узел по коду """ + CodeHub + """ в плане обмена """ + NamePlane + """";
		
		Возврат ОбщегоНазначения.Сериализовать( СтруктураРезультата ); 
		
	КонецЕсли;
	
	ПолноеИмяРегистраПолученныхСообщений = Метаданные.РегистрыСведений.ПолученныеСообщенияОбменовДанными.ПолноеИмя();
	
	Попытка
		
		СтруктураСообщения = ОбщегоНазначения.Десериализовать( StructMessage );
		
		СтруктураНовойЗаписи = ОбщегоНазначения.СформироватьСтруктуруЗаписиРегистра( ПолноеИмяРегистраПолученныхСообщений );
		ЗаполнитьЗначенияСвойств( СтруктураНовойЗаписи, СтруктураСообщения, "ВнеОчередиСообщений, НомерСообщения, ОбновитьНомерВУзлеПослеЗагрузки, НомерПоследнегоСообщенияПринятогоУзлом, ИмяФайлаСообщения, ХранилищеСообщения" );
		СтруктураНовойЗаписи.УзелИнформационнойБазы = УзелИнформационнойБазы;
		СтруктураНовойЗаписи.ДатаПолучения = ТекущаяДата();
		СтруктураНовойЗаписи.ВидТранспортаОбмена = ПредопределенноеЗначение( "Перечисление.ВидыТранспортаСообщенийОбмена.WS" );
		СтруктураНовойЗаписи.СообщенияРезультата = Строка( ТекущаяДата() ) + " - Получено через Web-сервис ExchangeFromUniversalXML (операция PutMessage)." + Символы.ПС;
		
		СтруктураОтбора = Новый Структура;
		врНаборЗаписей = РегистрыСведений.ПолученныеСообщенияОбменовДанными.СоздатьНаборЗаписей();
		Для Каждого Отбор Из врНаборЗаписей.Отбор Цикл
			СтруктураОтбора.Вставить( Отбор.Имя );
		КонецЦикла;
		
		// запись необходимо добавить не затирая существующие
		// потому будем проверять наличие записей с отсечкой по времени
		ЗаполнитьЗначенияСвойств( СтруктураОтбора, СтруктураНовойЗаписи );
		Пока Истина Цикл
			
			СтруктураОтбора.Период = ТекущаяДата();
			Если Не ОбщегоНазначения.РегистрСодержитЗаписи( СтруктураОтбора, ПолноеИмяРегистраПолученныхСообщений ) Тогда
				Прервать;
			КонецЕсли;
			
			// если записи есть, то подождем следующей секунды
			Пока СтруктураОтбора.Период >= ТекущаяДата() Цикл
				;
			КонецЦикла;
			
		КонецЦикла;
		
		СтруктураНовойЗаписи.Период = СтруктураОтбора.Период;
		РегистрыСведений.ПолученныеСообщенияОбменовДанными.ОбновитьДобавитьЗапись( СтруктураНовойЗаписи );
		
	Исключение
		
		СтруктураРезультата.БылиОшибки = Истина;
		СтруктураРезультата.ТекстОписанияОшибки = "Ошибка при сохранении сообщения для узла с кодом """ + CodeHub + """ в плане обмена """ + NamePlane + """,
			|по причине: " + ОписаниеОшибки();
		
		Попытка
			ОтменитьТранзакцию();
		Исключение
		КонецПопытки;
		
	КонецПопытки;
	
	Возврат ОбщегоНазначения.Сериализовать( СтруктураРезультата );
	
КонецФункции

Функция GetNextMessage(NamePlane, CodeHub)
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить( "БылиОшибки", Ложь );
	СтруктураРезультата.Вставить( "ТекстОписанияОшибки", "" );
	СтруктураРезультата.Вставить( "СтруктураСообщения" );
	
	УзелИнформационнойБазы = ОбменДаннымиСервер.ПолучитьСсылкуУзлаПоИмениПланаОбменаИКоду( NamePlane, CodeHub );
	
	Если УзелИнформационнойБазы = Неопределено Тогда
		
		СтруктураРезультата.БылиОшибки = Истина;
		СтруктураРезультата.ТекстОписанияОшибки = "Не найден узел по коду """ + CodeHub + """ в плане обмена """ + NamePlane + """";
		
		Возврат ОбщегоНазначения.Сериализовать( СтруктураРезультата ); 
		
	КонецЕсли;
	
	Попытка
		
		НачатьТранзакцию();
		
		СтруктураСообщенияИзРегистра = РегистрыСведений.СформированныеСообщенияОбменовДанными.ПолучитьСледующееСообщениеДляВыгрузки( УзелИнформационнойБазы );
		
		Если СтруктураСообщенияИзРегистра <> Неопределено Тогда
			
			СтруктураСообщенияИзРегистра.ВидТранспортаОбмена = ПредопределенноеЗначение( "Перечисление.ВидыТранспортаСообщенийОбмена.WS" );
			СтруктураСообщенияИзРегистра.СообщенияРезультата = Строка( СтруктураСообщенияИзРегистра.СообщенияРезультата ) + Символы.ПС + Строка( ТекущаяДата() ) + " - выгружено по внешнему запросу через веб-сервис";
			
			ОбменДаннымиСервер.ОтметитьСообщениеДляВыгрузкиКакВыгруженное( СтруктураСообщенияИзРегистра );
			
			СтруктураРезультата.СтруктураСообщения = Новый Структура( "ВнеОчередиСообщений, НомерСообщения, ОбновитьНомерВУзлеПослеЗагрузки, НомерПоследнегоСообщенияПринятогоУзлом, ИмяФайлаСообщения, ХранилищеСообщения" );
			ЗаполнитьЗначенияСвойств( СтруктураРезультата.СтруктураСообщения, СтруктураСообщенияИзРегистра );
		
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		СтруктураРезультата.БылиОшибки = Истина;
		СтруктураРезультата.ТекстОписанияОшибки = "Ошибка при получении сообщения от узла с кодом """ + CodeHub + """ в плане обмена """ + NamePlane + """,
			|по причине: " + ОписаниеОшибки();
		
		Попытка
			ОтменитьТранзакцию();
		Исключение
		КонецПопытки;
		
	КонецПопытки;
	
	Возврат ОбщегоНазначения.Сериализовать( СтруктураРезультата );
	
КонецФункции
